app/Http/Controllers/ProjectsController.php

    public function index()
    {

        if (empty( Auth::user())){
            return redirect()->route('login');
        }
        $userId = Auth::id();

        $projects = Projects::where('user_id', $userId)->orderBy('id', 'DESC')->paginate(10);
---
select * from `projects` where `user_id` = 1 and `projects`.`deleted_at` is null order by `id` desc limit 10 offset 0
select count(*) as aggregate from `projects` where `user_id` = 1 and `projects`.`deleted_at` is null

    public function show($id)
    {
        $project = Projects::find($id);
        $tasks = Tasks::where('project_id', $id)->orderBy('status', 'DESC')->paginate(3);
---
select * from `tasks` where `project_id` = '37' and `tasks`.`deleted_at` is null order by `status` desc limit 3 offset 0
select count(*) as aggregate from `tasks` where `project_id` = '37' and `tasks`.`deleted_at` is null

    public function update(Request $request, $id)
    {
        $data = $request->all();
        $project = Projects::find($id);
        $result = $project->update($data);
---
select * from `projects` where `id` in ('42') and `projects`.`deleted_at` is null
update `projects` set `deleted_at` = '2020-07-22 15:36:27', `projects`.`updated_at` = '2020-07-22 15:36:27' where `id` = 42