app/Http/Controllers/TasksController.php

select * from `tasks` where `id` in ('151') and `tasks`.`deleted_at` is null
update `tasks` set `deleted_at` = '2020-07-22 17:10:21', `tasks`.`updated_at` = '2020-07-22 17:10:21' where `id` = 151
---
    public function update(Request $request, $id)
    {
        $data = $request->input();
        $task = Tasks::find($id);
        $result = $task->update($data);